
## Plan Result (terraform/cloudflare/boxp.tk)

[CI link](https://github.com/boxp/arch/actions/runs/12017372045)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.root
  * cloudflare_record.www


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.root will be created
  + resource "cloudflare_record" "root" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "192.0.2.1"
      + zone_id         = "36afdec7e600ae91ce36590fc2320f39"
    }

  # cloudflare_record.www will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "@"
      + zone_id         = "36afdec7e600ae91ce36590fc2320f39"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with cloudflare_record.root,
  on dns.tf line 5, in resource "cloudflare_record" "root":
   5:   value   = "192.0.2.1" # 全て転送するので、ダミーのIPアドレスにしておく

`value` is deprecated in favour of `content` and will be removed in the next
major release.

(and 3 more similar warnings elsewhere)
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Argument is deprecated

  with cloudflare_record.root,
  on dns.tf line 5, in resource "cloudflare_record" "root":
   5:   value   = "192.0.2.1" # 全て転送するので、ダミーのIPアドレスにしておく

`value` is deprecated in favour of `content` and will be removed in the next
major release.

(and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2163,"Program":"tfcmt","SHA1":"febf7e9a2cec653f515ed678fcee519130e07cc2","Target":"terraform/cloudflare/boxp.tk","Vars":{},"WorkflowName":"pull_request_target"} -->